tutorials/pimpleFoamHFDIB/static_cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    z1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          225;
        startFace       40185;
    }
    z0
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          225;
        startFace       40410;
    }
    x1
    {
        type            patch;
        nFaces          90;
        startFace       40635;
    }
    x0
    {
        type            patch;
        nFaces          90;
        startFace       40725;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40500;
        startFace       40815;
    }
)

// ************************************************************************* //
