tutorials/pimpleFoamHFDIB/static_cylinder/constant/HFDIBDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
stlNames ("sphere");

interpolationSchemes
{
 U cellPointFace;
}

sphere
{
 
 staticBody;
 
 refineMC 5;
 
 U
 {
  BC  noSlip;
 }

}

// ************************************************************************* //
